[{"q":"Children in whom was no blemish, but well favoured, and skilful in all wisdom, and cunning in knowledge, and...","choices":["Daniel 4:11","Daniel 5:11","Daniel 1:4","Daniel 6:22"],"answer":2},{"q":"If it be so, our God whom we serve is able to deliver us from the burning fiery furnace, and he will deliver us out of thine hand, O king.","choices":["Daniel 6:18","Daniel 2:21","Daniel 4:2","Daniel 3:17"],"answer":3},{"q":"The king answered unto Daniel, and said, Of a truth it is, that your God is a God of gods, and a Lord of kings, and a...","choices":["Daniel 3:22","Daniel 6:19","Daniel 2:47","Daniel 1:19"],"answer":2},{"q":"Now at the end of the days that the king had said he should bring them in, then the prince of the eunuchs brought them...","choices":["Daniel 1:18","Daniel 5:17","Daniel 3:20","Daniel 4:28"],"answer":0},{"q":"Then said Daniel to Melzar, whom the prince of the eunuchs had set over Daniel, Hananiah, Mishael, and Azariah,","choices":["Daniel 5:14","Daniel 2:43","Daniel 1:11","Daniel 3:17"],"answer":2},{"q":"Then let our countenances be looked upon before thee, and the countenance of the children that eat of the portion of...","choices":["Daniel 6:25","Daniel 5:16","Daniel 4:20","Daniel 1:13"],"answer":3},{"q":"Unto whom the prince of the eunuchs gave names: for he gave unto Daniel the name of Belteshazzar; and to Hananiah, of...","choices":["Daniel 3:1","Daniel 1:7","Daniel 2:6","None of these"],"answer":1},{"q":"Then this Daniel was preferred above the presidents and princes, because an excellent spirit was in him; and the king...","choices":["Daniel 3:25","Daniel 6:3","Daniel 4:23","None of these"],"answer":1},{"q":"The same hour was the thing fulfilled upon Nebuchadnezzar: and he was driven from men, and did eat grass as oxen, and...","choices":["Daniel 3:29","Daniel 6:7","Daniel 2:26","None of these"],"answer":3},{"q":"I saw in the visions of my head upon my bed, and, behold, a watcher and an holy one came down from heaven;","choices":["Daniel 5:18","Daniel 2:38","Daniel 3:2","Daniel 4:13"],"answer":3},{"q":"And Darius the Median took the kingdom, being about threescore and two years old.","choices":["Daniel 5:11","Daniel 3:21","Daniel 5:31","Daniel 3:24"],"answer":2},{"q":"Daniel 3:30","choices":["Nebuchadnezzar the king, unto all people, nations, and languages, that dwell in all the earth; Peace be multiplied unto you.","How great are his signs! and how mighty are his wonders! his kingdom is an everlasting kingdom, and his dominion is...","Shadrach, Meshach, and Abed-nego, answered and said to the king, O Nebuchadnezzar, we are not careful to answer thee in this matter.","Then the king promoted Shadrach, Meshach, and Abed-nego, in the province of Babylon."],"answer":3},{"q":"All the presidents of the kingdom, the governors, and the princes, the counsellers, and the captains, have consulted...","choices":["Daniel 2:7","Daniel 6:3","Daniel 6:7","Daniel 2:41"],"answer":2},{"q":"In the third year of the reign of Jehoiakim king of Judah came Nebuchadnezzar king of Babylon unto Jerusalem, and besieged it.","choices":["Daniel 1:13","Daniel 3:15","Daniel 1:1","Daniel 3:21"],"answer":2},{"q":"Daniel 6:2","choices":["Nebuchadnezzar the king made an image of gold, whose height was threescore cubits, and the breadth thereof six cubits...","My God hath sent his angel, and hath shut the lions’ mouths, that they have not hurt me: forasmuch as before him...","And over these three presidents; of whom Daniel was first: that the princes might give accounts unto them, and the king...","Then the princes, the governors, and captains, the judges, the treasurers, the counsellers, the sheriffs, and all the..."],"answer":2},{"q":"Daniel 4:26","choices":["And thou his son, O Belshazzar, hast not humbled thine heart, though thou knewest all this;","Thus were the visions of mine head in my bed; I saw, and behold a tree in the midst of the earth, and the height thereof was great.","And whereas they commanded to leave the stump of the tree roots; thy kingdom shall be sure unto thee, after that thou...","None of the above"],"answer":2},{"q":"Daniel 3:3","choices":["And in all matters of wisdom and understanding, that the king inquired of them, he found them ten times better than all...","Then was Nebuchadnezzar full of fury, and the form of his visage was changed against Shadrach, Meshach, and Abed-nego...","Then the princes, the governors, and captains, the judges, the treasurers, the counsellers, the sheriffs, and all the...","None of the above"],"answer":2},{"q":"And over these three presidents; of whom Daniel was first: that the princes might give accounts unto them, and the king...","choices":["Daniel 6:27","Daniel 4:3","Daniel 6:2","Daniel 4:1"],"answer":2},{"q":"Daniel 6:5","choices":["Then they came near, and spake before the king concerning the king’s decree; Hast thou not signed a decree, that every...","And he commanded the most mighty men that were in his army to bind Shadrach, Meshach, and Abed-nego, and to cast them...","Then Nebuchadnezzar spake, and said, Blessed be the God of Shadrach, Meshach, and Abed-nego, who hath sent his angel...","Then said these men, We shall not find any occasion against this Daniel, except we find it against him concerning the law of his God."],"answer":3},{"q":"Then Nebuchadnezzar in his rage and fury commanded to bring Shadrach, Meshach, and Abed-nego. Then they brought these men before the king.","choices":["Daniel 3:29","Daniel 6:14","Daniel 6:8","None of the above"],"answer":3},{"q":"Daniel 2:46","choices":["Then the king Nebuchadnezzar fell upon his face, and worshipped Daniel, and commanded that they should offer an...","Thou sawest till that a stone was cut out without hands, which smote the image upon his feet that were of iron and...","They answered again and said, Let the king tell his servants the dream, and we will shew the interpretation of it.","Daniel answered in the presence of the king, and said, The secret which the king hath demanded cannot the wise men, the..."],"answer":0},{"q":"Then was the ____ exceeding glad for him, and commanded that they should take Daniel up out of the den. So ______ was...","choices":["Daniel 6:10","Daniel 6:2","Daniel 6:17","Daniel 6:23"],"answer":3},{"q":"Then Nebuchadnezzar the king sent to gather together the _______, the governors, and ___ captains, the judges, ___...","choices":["Daniel 3:9","Daniel 3:2","Daniel 3:12","Daniel 3:4"],"answer":1},{"q":"And he commanded the most mighty men that were in his army to bind Shadrach, Meshach, and ____-____, and to cast them...","choices":["Daniel 3:22","Daniel 3:20","Daniel 3:9","Daniel 3:30"],"answer":1},{"q":"But as for me, ____ secret is not revealed to me for any wisdom that I have more than any living, but for their sakes...","choices":["Daniel 2:30","Daniel 2:36","Daniel 2:11","Daniel 2:43"],"answer":0},{"q":"Then they came near, and _____ before ___ king concerning ___ king’s decree; Hast thou not signed a decree, that every...","choices":["Daniel 6:12","Daniel 6:18","Daniel 6:2","Daniel 6:10"],"answer":0},{"q":"And for the majesty that he gave ___, all people, nations, and _________, trembled and ______ before him: whom he would...","choices":["Daniel 5:12","Daniel 5:17","Daniel 5:19","None of the above"],"answer":2},{"q":"Nebuchadnezzar spake and said unto ____, Is it true, O Shadrach, Meshach, and Abed-nego, __ not ye serve my gods, ___...","choices":["Daniel 3:4","Daniel 3:9","Daniel 3:14","Daniel 3:13"],"answer":2},{"q":"But at the last Daniel came in before __, whose name was Belteshazzar, according to the name of my god, and in whom is...","choices":["Daniel 4:13","Daniel 4:22","Daniel 4:8","Daniel 4:16"],"answer":2},{"q":"And whereas the king saw a watcher and an holy one coming down from heaven, and saying, Hew ___ tree down, and destroy...","choices":["Daniel 4:17","Daniel 4:22","Daniel 4:23","Daniel 4:21"],"answer":2}]
